Rallare/nrf52_ble_app_hids_selfie_nfc/main.c
#define APP_FEATURE_NOT_SUPPORTED       BLE_GATT_STATUS_ATTERR_APP_BEGIN + 2            /**< Reply when unsupported features are requested. */

#define BASE_USB_HID_SPEC_VERSION        0x0101                                         /**< Version number of base USB HID Specification implemented by this application. */

#define INPUT_REPORT_KEYS_MAX_LEN        8                                              /**< Maximum length of the Input Report characteristic. */

#define DEAD_BEEF                        0xDEADBEEF                                     /**< Value used as error code on stack dump, can be used to identify stack location on stack unwind. */

#define MODIFIER_KEY_POS                 0                                              /**< Position of the modifier byte in the Input Report. */
#define SCAN_CODE_POS                    2                                              /**< This macro indicates the start position of the key scan code in a HID Report. As per the document titled 'Device Class Definition for Human Interface Devices (HID) V1.11, each report shall have one modifier byte followed by a reserved constant byte and then the key scan code. */
#define SHIFT_KEY_CODE                   0x02                                           /**< Key code indicating the press of the Shift Key. */

#define MAX_KEYS_IN_ONE_REPORT           (INPUT_REPORT_KEYS_MAX_LEN - SCAN_CODE_POS)    /**< Maximum number of key presses that can be sent in one Input Report. */

#define INPUT_CCONTROL_KEYS_INDEX		 1
#define INPUT_CC_REP_REF_ID				 2
#define INPUT_CC_REPORT_KEYS_MAX_LEN	 1

#ifdef NFC_ENABLE
/***************************************************************************************************
 * Start of modifications needed for BLE pairing over NFC
 **************************************************************************************************/
#include "nfc_lib.h"
#include "nfc_ble_pair_msg.h"
#include "nfc_ble_pair_msg_config.h"

#define NFC_BLE_JUST_WORKS_PAIRING       0  /**< Just Works pairing over NFC - Temporary Key (TK) always equal to 0 */
#define NFC_BLE_OOB_PAIRING              1  /**< Out-of-Band pairing over NFC - Temporary Key (TK) value can be configured. */
#define NFC_BLE_PAIRING_TYPE             NFC_BLE_JUST_WORKS_PAIRING

static volatile uint8_t                  m_advertising_flag = 0;
static ble_advdata_t                     m_advdata;

#ifdef  HAL_NFC_ENGINEERING_A_FTPAN_WORKAROUND
extern volatile uint8_t                  m_nfc_active;
#endif

#if (NFC_BLE_PAIRING_TYPE == NFC_BLE_OOB_PAIRING)
#define SEC_PARAM_MITM               0  /**< Man In The Middle protection not required. */
#define SEC_PARAM_OOB                1  /**< Out Of Band data available. */
// Hardcoded authentication OOB key
#define OOB_AUTH_KEY                 {                            \
                                        {                         \
                                          0xAA, 0xBB, 0xCC, 0xDD, \
                                          0xEE, 0xFF, 0x99, 0x88, \
                                          0x77, 0x66, 0x55, 0x44, \
                                          0x33, 0x22, 0x11, 0x00  \
                                        }                         \
                                     }

static ble_advdata_tk_value_t        m_oob_auth_key = OOB_AUTH_KEY;
#else
#define SEC_PARAM_MITM               0  /**< Man In The Middle protection not required. */
#define SEC_PARAM_OOB                0  /**< Out Of Band data not available. */
#endif /* NFC_BLE_PAIRING_TYPE */
#endif

typedef enum
{
    BLE_NO_ADV,               /**< No advertising running. */
    BLE_DIRECTED_ADV,         /**< Direct advertising to the latest central. */
    BLE_FAST_ADV_WHITELIST,   /**< Advertising with whitelist. */
    BLE_FAST_ADV,             /**< Fast advertising running. */
    BLE_SLOW_ADV,             /**< Slow advertising running. */
    BLE_SLEEP,                /**< Go to system-off. */
} ble_advertising_mode_t;

static ble_hids_t                        m_hids;                                        /**< Structure used to identify the HID service. */
static ble_bas_t                         m_bas;                                         /**< Structure used to identify the battery service. */
static bool                              m_in_boot_mode = false;                        /**< Current protocol mode. */
static uint16_t                          m_conn_handle = BLE_CONN_HANDLE_INVALID;       /**< Handle of the current connection. */
static app_timer_id_t                    m_battery_timer_id;                            /**< Battery timer. */
static dm_application_instance_t         m_app_handle;                                  /**< Application identifier allocated by device manager. */
static dm_handle_t                       m_bonded_peer_handle;                          /**< Device reference handle to the current bonded central. */

static ble_uuid_t m_adv_uuids[] = {{BLE_UUID_HUMAN_INTERFACE_DEVICE_SERVICE, BLE_UUID_TYPE_BLE}};

typedef enum
{
    RELEASE_KEY                     = 0x00,
    CONSUMER_CTRL_PLAY              = 0x01,
    CONSUMER_CTRL_ALCCC             = 0x02,
    CONSUMER_CTRL_SCAN_NEXT_TRACK   = 0x04,
    CONSUMER_CTRL_SCAN_PREV_TRACK   = 0x08,
    CONSUMER_CTRL_VOL_DW            = 0x10,
    CONSUMER_CTRL_VOL_UP            = 0x20,
    CONSUMER_CTRL_AC_FORWARD        = 0x40,
    CONSUMER_CTRL_AC_BACK           = 0x80,    
} consumer_control_t;

static void on_hids_evt(ble_hids_t * p_hids, ble_hids_evt_t * p_evt);

/**@brief Callback function for asserts in the SoftDevice.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyze
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in]   line_num   Line number of the failing ASSERT call.
 * @param[in]   file_name  File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}


/**@brief Function for handling Service errors.
 *
 * @details A pointer to this function will be passed to each service which may need to inform the
 *          application about an error.
 *
 * @param[in]   nrf_error   Error code containing information about what went wrong.
 */
static void service_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}


