Rallare/nrf52_ble_app_hids_selfie_nfc/main.c
static uint32_t hid_kbd_send_string(void)
{
    // Scan codes for hid: http://download.microsoft.com/download/1/6/1/161ba512-40e2-4cc9-843a-923143f3456c/translate.pdf
    uint8_t temp_buf[INPUT_REPORT_KEYS_MAX_LEN] = {0x00, 0x00, 0xb, 0xc, 0x2c, 0x0, 0x0, 0x0};   
    return ble_hids_inp_rep_send(&m_hids, INPUT_REPORT_KEYS_INDEX, INPUT_REPORT_KEYS_MAX_LEN, (uint8_t*)temp_buf);
}

static uint32_t hid_kbd_send_release(void)
{
    uint8_t temp_buf[INPUT_REPORT_KEYS_MAX_LEN] = {0, 0, 0, 0, 0, 0, 0, 0};   
    return ble_hids_inp_rep_send(&m_hids, INPUT_REPORT_KEYS_INDEX, INPUT_REPORT_KEYS_MAX_LEN, (uint8_t*)temp_buf);
}


/**@brief Function for initializing the Advertising functionality.
 */
static void advertising_init(void)
{    
    uint8_t        adv_flags;    

    adv_flags                         = BLE_GAP_ADV_FLAGS_LE_ONLY_LIMITED_DISC_MODE;
    m_advdata.name_type               = BLE_ADVDATA_FULL_NAME;
    m_advdata.include_appearance      = true;
    m_advdata.flags                   = adv_flags;
    m_advdata.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
    m_advdata.uuids_complete.p_uuids  = m_adv_uuids;
    ble_adv_modes_config_t options =
    {
        BLE_ADV_WHITELIST_ENABLED,
        BLE_ADV_DIRECTED_ENABLED,
        BLE_ADV_DIRECTED_SLOW_DISABLED, 0,0,
        BLE_ADV_FAST_ENABLED, APP_ADV_FAST_INTERVAL, APP_ADV_FAST_TIMEOUT,
        BLE_ADV_SLOW_ENABLED, APP_ADV_SLOW_INTERVAL, APP_ADV_SLOW_TIMEOUT
    };

    uint32_t err_code = ble_advertising_init(&m_advdata, NULL, &options, on_adv_evt, ble_advertising_error_handler);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling the Device Manager events.
 *
 * @param[in]   p_evt   Data associated to the device manager event.
 */
static uint32_t device_manager_evt_handler(dm_handle_t const    * p_handle,
                                           dm_event_t const     * p_event,
                                           ret_code_t           event_result)
{
    APP_ERROR_CHECK(event_result);

    switch(p_event->event_id)
    {
        case DM_EVT_DEVICE_CONTEXT_LOADED: // Fall through.
        case DM_EVT_SECURITY_SETUP_COMPLETE:
            m_bonded_peer_handle = (*p_handle);
            break;
    }

    return NRF_SUCCESS;
}


/**@brief Function for the Device Manager initialization.
 *
 * @param[in] erase_bonds  Indicates whether bonding information should be cleared from
 *                         persistent storage during initialization of the Device Manager.
 */
static void device_manager_init(bool erase_bonds)
{
    uint32_t               err_code;
    dm_init_param_t        init_param = {.clear_persistent_data = erase_bonds};
    dm_application_param_t  register_param;

    // Initialize peer device handle.
    err_code = dm_handle_initialize(&m_bonded_peer_handle);
    APP_ERROR_CHECK(err_code);
    
    // Initialize persistent storage module.
    err_code = pstorage_init();
    APP_ERROR_CHECK(err_code);

    err_code = dm_init(&init_param);
    APP_ERROR_CHECK(err_code);
    
    memset(&register_param.sec_param, 0, sizeof(ble_gap_sec_params_t));

    register_param.sec_param.bond         = SEC_PARAM_BOND;
    register_param.sec_param.mitm         = SEC_PARAM_MITM;
    register_param.sec_param.io_caps      = SEC_PARAM_IO_CAPABILITIES;
    register_param.sec_param.oob          = SEC_PARAM_OOB;
    register_param.sec_param.min_key_size = SEC_PARAM_MIN_KEY_SIZE;
    register_param.sec_param.max_key_size = SEC_PARAM_MAX_KEY_SIZE;
    register_param.evt_handler            = device_manager_evt_handler;
    register_param.service_type           = DM_PROTOCOL_CNTXT_GATT_SRVR_ID;

    err_code = dm_register(&m_app_handle, &register_param);
    APP_ERROR_CHECK(err_code);
}

void app_button_handler(uint8_t pin_no, uint8_t button_action)
{
    // If we're not in a connection, do not do anything. Assume it's wakeup.
    if (m_conn_handle != BLE_CONN_HANDLE_INVALID)
    {
        if (button_action == APP_BUTTON_PUSH)
        {
            switch (pin_no)
            {
                case BSP_BUTTON_0:
                    APP_ERROR_CHECK(consumer_control_send(CONSUMER_CTRL_VOL_DW));
                    break;
                case BSP_BUTTON_1:
                    APP_ERROR_CHECK(consumer_control_send(CONSUMER_CTRL_VOL_UP));
                    break;
                case BSP_BUTTON_2:
                    APP_ERROR_CHECK(hid_kbd_send_string());
                    break;
                case BSP_BUTTON_3:
                    /* Do nothing */ 
                    break;
                default:
                    APP_ERROR_HANDLER(pin_no);
                    break;            
            }
        }
        else if (button_action == APP_BUTTON_RELEASE)
        {
            switch (pin_no)
            {
                case BSP_BUTTON_0:
                /* Fall through*/
                case BSP_BUTTON_1:
                    APP_ERROR_CHECK(consumer_control_send(RELEASE_KEY));
                    break;
                case BSP_BUTTON_2:
                    APP_ERROR_CHECK(hid_kbd_send_release());
                    break;
                case BSP_BUTTON_3:
                    /* Do nothing */
                    break;
                default:
                    APP_ERROR_HANDLER(pin_no);
                    break;              
            }        
        }
    }
}


/**@brief Function for initializing buttons and leds.
 *
 * @param[out] p_erase_bonds  Will be true if the clear bonding button was pressed to wake the application up.
 */
static void buttons_leds_init(void)
{
    const uint32_t detection_delay = 50; // ms
    static app_button_cfg_t button_cfg[4] = 
    {
         {BSP_BUTTON_0, false, BUTTON_PULL, app_button_handler},
         {BSP_BUTTON_1, false, BUTTON_PULL, app_button_handler},
         {BSP_BUTTON_2, false, BUTTON_PULL, app_button_handler},
         {BSP_BUTTON_3, false, BUTTON_PULL, app_button_handler}
    };
    APP_ERROR_CHECK(app_button_init(button_cfg, (sizeof(button_cfg) / sizeof(button_cfg[0])), detection_delay));    
    APP_ERROR_CHECK(app_button_enable());
    
