Rallare/nrf52_ble_app_hids_selfie_nfc/main.c
    nrf_gpio_cfg_output(BSP_LED_0);
    nrf_gpio_cfg_output(BSP_LED_1);
    nrf_gpio_cfg_output(BSP_LED_2);
    nrf_gpio_cfg_output(BSP_LED_3);
    NRF_GPIO->OUTSET = (1 << BSP_LED_0) | 1 << BSP_LED_1 | 1 << BSP_LED_2 | 1 << BSP_LED_3;
    
}


/**@brief Function for the Power manager.
 */
static void power_manage(void)
{
#ifdef  HAL_NFC_ENGINEERING_A_FTPAN_WORKAROUND    
    if (!m_nfc_active)
#endif        
    {
        uint32_t err_code = sd_app_evt_wait();
        APP_ERROR_CHECK(err_code);
    }
}

#ifdef NFC_ENABLE
/**@brief Function for re-initializing the Advertising module with fast advertising mode enabled.
 */
static void advertising_enable(void)
{
    uint32_t      err_code;

    ble_adv_modes_config_t options    = {0};
    options.ble_adv_fast_enabled  = BLE_ADV_FAST_ENABLED;
    options.ble_adv_fast_interval = APP_ADV_FAST_INTERVAL;
    options.ble_adv_fast_timeout  = APP_ADV_FAST_TIMEOUT;

    err_code = ble_advertising_init(&m_advdata, NULL, &options, on_adv_evt, NULL);
    APP_ERROR_CHECK(err_code);
}

static void nfc_callback(void * context, NfcEvent event, const char *data, size_t dataLength)
{
    (void) context;
    uint32_t err_code;

    switch (event)
    {
        case NFC_EVENT_FIELD_ON:
            LEDS_ON(BSP_LED_3_MASK);
            /* Start advertising to become connectable */
            if (!m_advertising_flag)
            {
                m_advertising_flag  = 1;
                advertising_enable();
                err_code = ble_advertising_start(BLE_ADV_MODE_FAST);
                APP_ERROR_CHECK(err_code);
            }
            break;
        case NFC_EVENT_FIELD_OFF:
            LEDS_OFF(BSP_LED_3_MASK);
            break;
        default:
            break;
    }
    return;
}


static void nfc_init(void)
{
    ble_advdata_t adv_data;
    uint8_t *     p_message;
    uint16_t      message_len;
    uint32_t      err_code = NRF_SUCCESS;
    NfcRetval     ret_val;
    

    /* Prepare advdata structure as input to create payload of the NFC message */
    memset((uint8_t *) &adv_data, 0, sizeof(ble_advdata_t));

    adv_data.include_appearance = true;
    adv_data.name_type          = BLE_ADVDATA_FULL_NAME;
#if (NFC_BLE_PAIRING_TYPE == NFC_BLE_OOB_PAIRING)
    adv_data.p_tk_value = &m_oob_auth_key;
#endif /* NFC_BLE_PAIRING_TYPE */

#if ((NFC_BLE_PAIR_MSG_CONFIG_MSG_TYPE == NFC_BLE_PAIR_MSG_BLUETOOTH_LE_SHORT) || \
     (NFC_BLE_PAIR_MSG_CONFIG_MSG_TYPE == NFC_BLE_PAIR_MSG_BLUETOOTH_LE_FULL))

    adv_data.include_ble_device_addr = true;
    adv_data.le_role                 = BLE_ADVDATA_ROLE_ONLY_PERIPH;
    adv_data.flags                   = BLE_GAP_ADV_FLAG_BR_EDR_NOT_SUPPORTED;

#elif ((NFC_BLE_PAIR_MSG_CONFIG_MSG_TYPE == NFC_BLE_PAIR_MSG_BLUETOOTH_EP_SHORT) || \
       (NFC_BLE_PAIR_MSG_CONFIG_MSG_TYPE == NFC_BLE_PAIR_MSG_BLUETOOTH_EP_FULL))

    uint8_t sec_mgr_oob_flags = (AD_TYPE_SEC_MGR_OOB_FLAG_SET   << AD_TYPE_SEC_MGR_OOB_FLAG_OOB_DATA_PRESENT_POS) |
                                (AD_TYPE_SEC_MGR_OOB_FLAG_SET   << AD_TYPE_SEC_MGR_OOB_FLAG_OOB_LE_SUPPORTED_POS) |
                                (AD_TYPE_SEC_MGR_OOB_FLAG_CLEAR << AD_TYPE_SEC_MGR_OOB_FLAG_SIM_LE_AND_EP_POS)    |
                                (AD_TYPE_SEC_MGR_OOB_ADDRESS_TYPE_RANDOM << AD_TYPE_SEC_MGR_OOB_FLAG_ADDRESS_TYPE_POS);
    adv_data.p_sec_mgr_oob_flags = &sec_mgr_oob_flags;

#else
    #error "Error. Type of NFC NDEF message used for BLE pairing over NFC not specified."
#endif /* NFC_BLE_PAIR_MSG_CONFIG_MSG_TYPE */

    /* Create the NFC message */
    err_code = nfc_ble_pair_msg_create(&adv_data, &p_message, &message_len);
    APP_ERROR_CHECK(err_code);

    /* Start NFC */
    ret_val = nfcSetup(nfc_callback, NULL);
    if (ret_val != NFC_RETVAL_OK)
    {
        APP_ERROR_CHECK((uint32_t) ret_val);
    }

    ret_val = nfcSetPayload((char *)p_message, message_len);
    if (ret_val != NFC_RETVAL_OK)
    {
        APP_ERROR_CHECK((uint32_t) ret_val);
    }

    ret_val = nfcStartEmulation();
    if (ret_val != NFC_RETVAL_OK)
    {
        APP_ERROR_CHECK((uint32_t) ret_val);
    }

    return;
}
#endif

/**@brief Function for application main entry.
 */
int main(void)
{   
    // Initialize.
    app_trace_init();
    timers_init();   
    ble_stack_init();
    buttons_leds_init();
    #ifdef DEBUG
    device_manager_init(true);
    #else
    device_manager_init(false);
    #endif
    gap_params_init();
    advertising_init();
    services_init();
    conn_params_init();
    
#ifdef NFC_ENABLE
    nfc_init();
#endif    
    // Start execution.
    timers_start();
#ifndef NFC_ENABLE    
    uint32_t err_code = ble_advertising_start(BLE_ADV_MODE_FAST);
    APP_ERROR_CHECK(err_code);
#endif    
    // Enter main loop.
    for (;;)
    {
        power_manage();
    }
}

/**
 * @}
 */
